tap "koekeishiya/formulae"

# Development tools
brew "gh"
brew "git" 
brew "gnupg"
brew "go"
brew "jq"
brew "openjdk"
brew "openjdk@21"
brew "maven"

# Window management
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

# Applications
cask "1password"
cask "1password-cli"
cask "battery"
cask "chatgpt"
cask "claude"
cask "cursor"
cask "discord"
cask "flux-app"
cask "focusrite-control"
cask "google-chrome"
cask "granola"
cask "karabiner-elements"
cask "minecraft"
cask "nordvpn"
cask "obsidian"
cask "slack"
cask "warp"