tap "koekeishiya/formulae"
tap "garethgeorge/homebrew-backrest-tap"
tap "stripe/stripe-cli"

# Development tools
brew "gh"
brew "git"
brew "gnupg"
brew "pinentry-mac"
brew "go"
brew "jq"
brew "openjdk"
brew "openjdk@21"
brew "maven"
brew "python@3.12"
brew "python@3.14"
brew "pyenv"
brew "pipx"
brew "rust"
brew "tree"
brew "wget"
brew "curl"
brew "htop"
brew "fastfetch"
brew "fd"
brew "ripgrep"
brew "bat"
brew "eza"
brew "fzf"
brew "node"
brew "xcodegen"
brew "xmlstarlet"
brew "speedtest-cli"
brew "stripe/stripe-cli/stripe"

# Window management
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

# Backup
brew "garethgeorge/backrest-tap/backrest"

# Applications
cask "1password"
cask "1password-cli"
cask "battery"
cask "chatgpt"
cask "claude-code"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "flux-app"
cask "google-chrome"
cask "granola"
cask "karabiner-elements"
cask "minecraft"
cask "nordvpn"
cask "obsidian"
cask "warp"
cask "vlc"
cask "whatsapp"
cask "steam"
cask "stremio"
