tap "koekeishiya/formulae"
brew "git"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "1password"
cask "1password-cli"
cask "cursor"
cask "discord"
cask "flux-app"
cask "google-chrome"
cask "karabiner-elements"
cask "nordvpn"
cask "warp"
cask "chatgpt"
cask "claude"
cask "zed"
cask "comfyui"
cask "focusrite-control"
cask "granola"
cask "minecraft"
cask "obsidian"
brew "battery"